Hyooki/STM32DUINO_GAMEPAD/variants/pindefinition_examples/Official STM32L476G-EVAL.c

enum {
//*=default , +=alternate
//PIN    |BOARD LABEL                            |I2C1|I2C2|I2C3|SPI1 |SPI2 |SPI3 |USART1|USART2|USART3|ADC1 |TIM (PWM)                                  |USB       |RCC       |SYS        
PA0 , // |OpAmp1_INP [RV3]                       |    |    |    |     |     |     |      |      |      |*IN5 |*TIM2_CH1 +TIM5_CH1                        |          |          |           
PA1 , // |OpAmp1_INM                             |    |    |    |     |     |     |      |      |      |*IN6 |*TIM2_CH2 +TIM5_CH2 *TIM15_CH1N            |          |          |           
PA2 , // |                                       |    |    |    |     |     |     |      |*TX   |      |*IN7 |*TIM2_CH3 +TIM5_CH3 +TIM15_CH1             |          |          |           
PA3 , // |OpAmp1_OUT [TP9]                       |    |    |    |     |     |     |      |*RX   |      |*IN8 |*TIM2_CH4 +TIM5_CH4 +TIM15_CH2             |          |          |           
PA4 , // |ADC_DAC                                |    |    |    |     |     |     |      |      |      |*IN9 |                                           |          |          |           
PA5 , // |IDD_Measurement [SN74LVC1G66DCKT_O/I]  |    |    |    |*SCK |     |     |      |      |      |*IN10|*TIM8_CH1N +TIM2_CH1                       |          |          |           
PA6 , // |                                       |    |    |    |*MISO|     |     |      |      |      |*IN11|+TIM3_CH1 *TIM16_CH1                       |          |          |           
PA7 , // |                                       |    |    |    |*MOSI|     |     |      |      |      |*IN12|+TIM8_CH1N +TIM3_CH2 *TIM1_CH1N *TIM17_CH1 |          |          |           
PA8 , // |uSD_DETECT                             |    |    |    |     |     |     |      |      |      |     |+TIM1_CH1                                  |          |          |           
PA9 , // |USBOTG_VBUS                            |    |    |    |     |     |     |*TX   |      |      |     |+TIM1_CH2                                  |          |          |           
PA10, // |USBOTG_ID                              |    |    |    |     |     |     |*RX   |      |      |     |+TIM1_CH3                                  |          |          |           
PA11, // |USBOTG_DM                              |    |    |    |     |     |     |      |      |      |     |+TIM1_CH4                                  |*OTG_FS_DM|          |           
PA12, // |USBOTG_DP                              |    |    |    |     |     |     |      |      |      |     |                                           |*OTG_FS_DP|          |           
PA13, // |TMS/SWDIO                              |    |    |    |     |     |     |      |      |      |     |                                           |          |          |*JTMS-SWDIO
PA14, // |TMS/SWCLK                              |    |    |    |     |     |     |      |      |      |     |                                           |          |          |*JTCK-SWCLK
PA15, // |                                       |    |    |    |     |     |     |      |      |      |     |+TIM2_CH1                                  |          |          |*JTDI      
PB0 , // |SmartCard_CLK                          |    |    |    |     |     |     |      |      |      |*IN15|*TIM8_CH2N +TIM3_CH3 *TIM1_CH2N            |          |          |           
PB1 , // |                                       |    |    |    |     |     |     |      |      |      |*IN16|+LPTIM2_IN1 +TIM3_CH4 *TIM1_CH3N *TIM8_CH3N|          |          |           
PB2 , // |LED1 [Green]                           |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PB3 , // |                                       |    |    |    |+SCK |     |+SCK |      |      |      |     |+TIM2_CH2                                  |          |          |*JTDO-SWO  
PB4 , // |comp2_INP[Potentiometer_RV3]           |    |    |    |+MISO|     |+MISO|      |      |      |     |+TIM3_CH1                                  |          |          |*JTRST     
PB5 , // |Comp2_OUT [TP6]                        |    |    |    |+MOSI|     |+MOSI|      |      |      |     |+TIM3_CH2 +LPTIM1_IN1                      |          |          |           
PB6 , // |USART1_TX                              |+SCL|    |    |     |     |     |+TX   |      |      |     |*TIM16_CH1N +TIM4_CH1                      |          |          |           
PB7 , // |USART1/IrDA_RX_3V3                     |+SDA|    |    |     |     |     |+RX   |      |      |     |*TIM17_CH1N +LPTIM1_IN2 +TIM4_CH2          |          |          |*PVD_IN    
PB8 , // |CAN_RX                                 |+SCL|    |    |     |     |     |      |      |      |     |+TIM16_CH1 +TIM4_CH3                       |          |          |           
PB9 , // |CAN_TX                                 |+SDA|    |    |     |     |     |      |      |      |     |+TIM17_CH1 +TIM4_CH4                       |          |          |           
PB10, // |                                       |    |+SCL|    |     |*SCK |     |      |      |+TX   |     |+TIM2_CH3                                  |          |          |           
PB11, // |                                       |    |+SDA|    |     |     |     |      |      |+RX   |     |+TIM2_CH4                                  |          |          |           
PB12, // |USBOTG_OVRCR                           |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PB13, // |NFC_SCK                                |    |+SCL|    |     |+SCK |     |      |      |      |     |+TIM1_CH1N +TIM15_CH1N                     |          |          |           
PB14, // |NFC_MISO                               |    |+SDA|    |     |+MISO|     |      |      |      |     |+TIM8_CH2N +TIM1_CH2N +TIM15_CH1           |          |          |           
PB15, // |NFC_MOSI                               |    |    |    |     |+MOSI|     |      |      |      |     |+TIM1_CH3N +TIM8_CH3N +TIM15_CH2           |          |          |           
PC0 , // |DMCI_DATAIN [MP34DT01TR_DOUT]          |    |    |*SCL|     |     |     |      |      |      |*IN1 |*LPTIM2_IN1 *LPTIM1_IN1                    |          |          |           
PC1 , // |                                       |    |    |*SDA|     |     |     |      |      |      |*IN2 |                                           |          |          |           
PC2 , // |DFSM_CKOUT                             |    |    |    |     |*MISO|     |      |      |      |*IN3 |*LPTIM1_IN2                                |          |          |           
PC3 , // |VLCD                                   |    |    |    |     |*MOSI|     |      |      |      |*IN4 |                                           |          |          |           
PC4 , // |SmartCard_IO                           |    |    |    |     |     |     |      |      |*TX   |*IN13|                                           |          |          |           
PC5 , // |IDD_WAKEUP                             |    |    |    |     |     |     |      |      |*RX   |*IN14|                                           |          |          |           
PC6 , // |USBOTG_PPWR                            |    |    |    |     |     |     |      |      |      |     |*TIM8_CH1 +TIM3_CH1                        |          |          |           
PC7 , // |PT100_DATIN                            |    |    |    |     |     |     |      |      |      |     |*TIM8_CH2 +TIM3_CH2                        |          |          |           
PC8 , // |uSD_D0                                 |    |    |    |     |     |     |      |      |      |     |*TIM8_CH3 +TIM3_CH3                        |          |          |           
PC9 , // |uSD_D1                                 |    |    |    |     |     |     |      |      |      |     |*TIM8_CH4 +TIM3_CH4                        |          |          |           
PC10, // |uSD_D2                                 |    |    |    |     |     |*SCK |      |      |+TX   |     |                                           |          |          |           
PC11, // |uSD_D3                                 |    |    |    |     |     |*MISO|      |      |+RX   |     |                                           |          |          |           
PC12, // |uSD_CLK                                |    |    |    |     |     |*MOSI|      |      |      |     |                                           |          |          |           
PC13, // |Key [B2]                               |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PC14, // |                                       |    |    |    |     |     |     |      |      |      |     |                                           |          |*OSC32_IN |           
PC15, // |                                       |    |    |    |     |     |     |      |      |      |     |                                           |          |*OSC32_OUT|           
PD0 , // |D2                                     |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PD1 , // |D3                                     |    |    |    |     |+SCK |     |      |      |      |     |                                           |          |          |           
PD2 , // |uSD_CMD                                |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PD3 , // |DFSDM_DATIN1                           |    |    |    |     |+MISO|     |      |      |      |     |                                           |          |          |           
PD4 , // |FMC_NOE                                |    |    |    |     |+MOSI|     |      |      |      |     |                                           |          |          |           
PD5 , // |FMC_NWE                                |    |    |    |     |     |     |      |+TX   |      |     |                                           |          |          |           
PD6 , // |SAI1_SDA [WM8994ECS/R_ADCDAT1]         |    |    |    |     |     |     |      |+RX   |      |     |                                           |          |          |           
PD7 , // |FMC_NE1 [IS61WV102416BLL-10MLI_CE]     |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PD8 , // |D13                                    |    |    |    |     |     |     |      |      |+TX   |     |                                           |          |          |           
PD9 , // |D14                                    |    |    |    |     |     |     |      |      |+RX   |     |                                           |          |          |           
PD10, // |D15                                    |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PD11, // |A16                                    |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PD12, // |A17                                    |    |    |    |     |     |     |      |      |      |     |+LPTIM2_IN1 *TIM4_CH1                      |          |          |           
PD13, // |A18                                    |    |    |    |     |     |     |      |      |      |     |*TIM4_CH2                                  |          |          |           
PD14, // |D0                                     |    |    |    |     |     |     |      |      |      |     |*TIM4_CH3                                  |          |          |           
PD15, // |D1                                     |    |    |    |     |     |     |      |      |      |     |*TIM4_CH4                                  |          |          |           
PE0 , // |FMC_NBL0 [IS61WV102416BLL-10MLI_BLE]   |    |    |    |     |     |     |      |      |      |     |+TIM16_CH1                                 |          |          |           
PE1 , // |FMC_NBL1 [IS61WV102416BLL-10MLI_BHE]   |    |    |    |     |     |     |      |      |      |     |+TIM17_CH1                                 |          |          |           
PE2 , // |A23                                    |    |    |    |     |     |     |      |      |      |     |                                           |          |          |*TRACECLK  
PE3 , // |A19                                    |    |    |    |     |     |     |      |      |      |     |*TIM3_CH1                                  |          |          |*TRACED0   
PE4 , // |A20                                    |    |    |    |     |     |     |      |      |      |     |*TIM3_CH2                                  |          |          |*TRACED1   
PE5 , // |A21                                    |    |    |    |     |     |     |      |      |      |     |*TIM3_CH3                                  |          |          |*TRACED2   
PE6 , // |A22                                    |    |    |    |     |     |     |      |      |      |     |*TIM3_CH4                                  |          |          |*TRACED3   
PE7 , // |D4                                     |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PE8 , // |D5                                     |    |    |    |     |     |     |      |      |      |     |+TIM1_CH1N                                 |          |          |           
PE9 , // |D6                                     |    |    |    |     |     |     |      |      |      |     |*TIM1_CH1                                  |          |          |           
PE10, // |D7                                     |    |    |    |     |     |     |      |      |      |     |+TIM1_CH2N                                 |          |          |           
PE11, // |D8                                     |    |    |    |     |     |     |      |      |      |     |*TIM1_CH2                                  |          |          |           
PE12, // |D9                                     |    |    |    |     |     |     |      |      |      |     |+TIM1_CH3N                                 |          |          |           
PE13, // |D10                                    |    |    |    |+SCK |     |     |      |      |      |     |*TIM1_CH3                                  |          |          |           
PE14, // |D11                                    |    |    |    |+MISO|     |     |      |      |      |     |*TIM1_CH4                                  |          |          |           
PE15, // |D12                                    |    |    |    |+MOSI|     |     |      |      |      |     |                                           |          |          |           
PF0 , // |A0                                     |    |*SDA|    |     |     |     |      |      |      |     |                                           |          |          |           
PF1 , // |A1                                     |    |*SCL|    |     |     |     |      |      |      |     |                                           |          |          |           
PF2 , // |A2                                     |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PF3 , // |A3                                     |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PF4 , // |A4                                     |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PF5 , // |A5                                     |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PF6 , // |SAI1_SDB [WM8994ECS/R_DACDAT1]         |    |    |    |     |     |     |      |      |      |     |*TIM5_CH1                                  |          |          |           
PF7 , // |SAI1_MCKB [WM8994ECS/R_MCLK1]          |    |    |    |     |     |     |      |      |      |     |*TIM5_CH2                                  |          |          |           
PF8 , // |SAI1_SCKB [WM8994ECS/R_BCLK1]          |    |    |    |     |     |     |      |      |      |     |*TIM5_CH3                                  |          |          |           
PF9 , // |SAI1_FSB [WM8994ECS/R_LRCLK1]          |    |    |    |     |     |     |      |      |      |     |*TIM5_CH4 *TIM15_CH1                       |          |          |           
PF10, // |                                       |    |    |    |     |     |     |      |      |      |     |*TIM15_CH2                                 |          |          |           
PF11, // |NFC_NSS                                |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PF12, // |A6                                     |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PF13, // |A7                                     |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PF14, // |A8                                     |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PF15, // |A9                                     |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PG0 , // |A10                                    |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PG1 , // |A11                                    |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PG2 , // |A12                                    |    |    |    |+SCK |     |     |      |      |      |     |                                           |          |          |           
PG3 , // |A13                                    |    |    |    |+MISO|     |     |      |      |      |     |                                           |          |          |           
PG4 , // |A14                                    |    |    |    |+MOSI|     |     |      |      |      |     |                                           |          |          |           
PG5 , // |A15                                    |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PG6 , // |CODEC_INT [WM8994ECS/R_ADCLRCLK1/GPIO1]|    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PG7 , // |LPUART_TX                              |    |    |+SCL|     |     |     |      |      |      |     |                                           |          |          |           
PG8 , // |LPUART_RX_3V3                          |    |    |+SDA|     |     |     |      |      |      |     |                                           |          |          |           
PG9 , // |FMC_NE2 [M29W256GL70ZA6E_E]            |    |    |    |     |     |+SCK |+TX   |      |      |     |+TIM15_CH1N                                |          |          |           
PG10, // |LCD_NE3 [SN74LVC16T245DGGR_OE]         |    |    |    |     |     |+MISO|+RX   |      |      |     |+LPTIM1_IN1 +TIM15_CH1                     |          |          |           
PG11, // |USART1_CTS_3V3                         |    |    |    |     |     |+MOSI|      |      |      |     |+LPTIM1_IN2 +TIM15_CH2                     |          |          |           
PG12, // |USART1_RTS                             |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PG13, // |I2C_SDA [WM8994ECS/R_SDA]              |*SDA|    |    |     |     |     |      |      |      |     |                                           |          |          |           
PG14, // |I2C_SCL [WM8994ECS/R_SCLK]             |*SCL|    |    |     |     |     |      |      |      |     |                                           |          |          |           
PG15, // |IOExpander_INT                         |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PH0 , // |                                       |    |    |    |     |     |     |      |      |      |     |                                           |          |*OSC_IN   |           
PH1 , // |                                       |    |    |    |     |     |     |      |      |      |     |                                           |          |*OSC_OUT  |           
NB_DIGITAL_PINS,
};

#include "stm32f1xx_hal.h"
#include "spi_com.h"
#include "twi.h"
#include "uart.h"
#include "analog.h"
#include "variant.h"

